[
  {
    "_id": "65e82c613e9f532e3f69eed3",
    "title": "TOYOTA RAV4 vs VOLKSWAGEN TIGUAN vs HONDA CRV: which one should I buy?",
    "description":"The Tiguan, CRV and Rav4 are smart upgrades from the Premio. You’ll get more power, better driving position and most importantly they can get over poorly erected bumps with ease. Everything comes at a cost meaning you should be prepared to cough more coins at the gas station and possibly during parts replacement. That shouldn’t be much of a bother since you are ‘upgrading’. "
  },
  {
    "_id": "65e82f35b73e26818417fc0c",
    "title": "LANDCRUISER PRADO KAKADU",
    "description":"The Kakadu sits at the top of the Prado hierarchy. The name Kakadu is derived from one of the biggest Australian national parks in a region where the car sells like a hotcake. It utilizes the ubiquitous 1GD 2.8l turbodiesel and only comes with an automatic gearbox with 4WD being standard and full-time. The main difference between the Kakadu and lower trims is that it comes with a Kinetic Dynamic Suspension System (KDSS), which improves stability."
  },
  {
    "_id": "65e8316dd38af23cc5e80538",
    "title": "TOYOTA KLUGER VS FORESTER VS OUTBACK VS NISSAN NAVARA",
    "description":"Sammy writes, “Hello 0-60, I have been following you for a while and I want your help. I want to buy a raised car for my father who recently retired. I have seen car prices are very high so I want to buy him a locally used car. I have narrowed down to a Toyota Kluger, Forester SG5, Outback and a Nissan Navara, all 2004 models. Back home roads are not that good hence my choices. Don’t be surprised about the Navara. Its prices are attractive and I assume being a diesel it could be easy on fuel. The four cars are in the same price range. Which one do I get him giving weight on reliability, fuel economy and general ease of use?”"
  },
  {
    "_id": "65e832e963e254724b3a78c9",
    "title": "TOYOTA AXIO OR HONDA GRACE?",
    "description":"Patrick writes, “Hello, I have been following you for while and now intend to buy my first car. I’m looking for something economical that is fuel efficient (15km/l or more), powerful, availability of spares and has a good resale value. I will appreciate your thoughts about the Toyota Axio and Honda Grace. I enjoyed the review you did on the Grace and that’s why I want to see how it compares to the Axio. My budget is 1.5m, maximum 1.6”"
  },
  {
    "_id": "65e8351e04788d7b2b877809",
    "title": "SUBARU OUTBACK VS SUBARU FORESTER: WHICH ONE SHOULD I BUY?",
    "description":"Tony writes “Hello there. Thank you for the good job you are doing in educating us about cars. What would be your review about 2016 Honda Vezel and Subaru XV, both non hybrid. They are offered at the same price. I’m coming from a Toyota Avensis and looking for something that can traverse both tarmac and slight offroad as I like camping. Previously I wanted a CX3 but I find it too tiny. What would be the best option considering I’m a road trip addict.”"
  },
  {
    "_id": "65e8364e51cd446c0af4674f",
    "title": "SUBARU XV vs HONDA VEZEL",
    "description":"Tony writes “Hello there. Thank you for the good job you are doing in educating us about cars. What would be your review about 2016 Honda Vezel and Subaru XV, both non hybrid. They are offered at the same price. I’m coming from a Toyota Avensis and looking for something that can traverse both tarmac and slight offroad as I like camping. Previously I wanted a CX3 but I find it too tiny. What would be the best option considering I’m a road trip addict.”"
  },
  {
    "_id": "65e8379f9e751eb91ffe0605",
    "title": "NISSAN SKYLINE vs TOYOTA CROWN ATHLETE vs MAZDA ATENZA",
    "description":"Willy writes, “Hello team. Am a bit confused here and would like to seek your advice. I have a 2006 Toyota Mark X and I feel its now time for an upgrade to something newer. I have identified a 2015 Nissan Skyline which has been locally used and it has good features including a sunroof. I’m skeptical considering Nissan cars are known to be problematic. I also checked a 2016 Mazda Atenza not locally used 2000cc and a locally used 2015 Toyota Crown Athlete (nonhybrid) which has around 115k km."
  },
  {
    "_id": "65e8395ce9b7a7d42ce59da6",
    "title": "HONDA VEZEL vs TOYOTA RUSH vs MAZDA CX3 vs NISSAN JUKE",
    "description":"‘Kindly advise what is the best car among the Rush, CX3 diesel, Vezel nonhybrid and the Nissan Juke. Looking at something powerful, good looking, fuel efficient, reliable, spacious and can withstand bad roads once in a while. There’s no denying that the rush for something with good ground clearance has seen automakers jack up small hatchbacks and dub them as crossovers. Every manufacturer wants to have as many ‘raised’ cars as possible."
  },
  {
    "_id": "65e83b54b2f83db479854133",
    "title": "BMW X1 vs PEUGEOT 3008 vs TOYOTA HARRIER",
    "description":"Mark writes, “Hey there. Your big fan here. I have a Subaru Impreza 2010 1500cc which you recently described as painfully slow. I agree with you on that but it has been reliable. I love Subaru cars and seeking to upgrade to either a 2016 Forester or Outback. Initially I wanted a Legacy but I realized their prices have shot up and the wagon shape is no more. I’m looking for more power, ground clearance, reliability and something presentable. "
  }
]